[
  {
    "title":"Washington to Baltimore",
    "text":"<p><strong>7:00 a.m.:</strong> <a href='https://www.youtube.com/watch?v=f8d3SqtPVlg'>&ldquo;We are moving! We are moving!&rdquo;</a></p><p>Surprisingly good service in Union Station and up to Baltimore. I briefly considered writing a #SlatePitch about how great the service is and why people are wrong to complain.</p>",
    "lat":39.102024,
    "lng":-76.819153,
    "id":1,
	"direction": 0,
	"zoom": 9
  },
  {
    "title":"Baltimore to Philadelphia",
    "text":"<p>A couple things I quickly discovered as the Wi-Fi got worse: The tests could take minutes to load, and by then, the train was several minutes away from the original testing spot. And both websites didn’t always connect.</p><p>Streaming video? Not a chance—the AmtrakConnect Wi-Fi actually blocks YouTube and Netflix, and Amtrak is up-front about its <a href=\"http://www.amtrak.com/journey-with-wi-fi-train-station\">limitations</a>.</p><p>Unable to spend the time watching movies, how about doing some work? Problem: Continuous use is just impossible for much of the trip—the connection is too choppy. Sending email wasn’t the most horrible experience, no more annoying than losing your cell signal on the D.C. metro, but nothing to brag about.</p>",
    "lat":39.590543,
    "lng":-75.869548,
    "id":2,
	"direction": 0,
	"zoom": 8
  },
  {
    "title":"Philadelphia to New York",
    "text":"<p>The area north of Philadelphia through Trenton is a major dead spot. Nothing seemed to load quickly—even the two speed-checking sites were having major difficulties. Arrived in New York about five minutes behind schedule.</p>",
    "lat":40.306433,
    "lng":-74.608154,
    "id":3,
	"direction": 0,
	"zoom": 8,
	"img": "img/dan.jpg",
	"caption": "Sigh."
  },
  {
    "title":"New York to Philadelphia",
    "text":"One improvement between the current Penn Station and the <a href=\"http://glassian.org/Prism/Gallery/NewYork/penn_station.html\">historic building it replaced</a>: The in-station Amtrak Wi-Fi is really good.</p><p>Eschewing the <a href=\"http://www.slate.com/blogs/moneybox/2013/07/11/penn_station_boarding_secret.html\">millennial-favored hack</a>, I boarded the 6 p.m. Acela southbound. (My preferred hack: Ask a Red Cap which track your train is on and wait there.)</p><p>Out of New York, the connection was mediocre, but at least it worked, letting me look up some the history of the Northeast Corridor route, like the early 1970s Metropark Station, once briefly named for Abscam-linked <a href=\"https://rucore.libraries.rutgers.edu/rutgers-lib/40994/\">Sen. Harrison Williams</a>. Or the former <a href=\"http://www.newjerseynewsroom.com/style/origin-of-manhattan-transfer-is-part-of-nj-history\">Manhattan Transfer location</a>, located near Secaucus Junction, which is named after a non-Abscam senator, the late <a href=\"http://www.nj.com/news/index.ssf/2013/06/us_sen_frank_lautenberg_gets_on_last_ride_in_the_secaucus_station.html\">Frank Lautenberg</a>).</p>",
    "lat":40.306433,
    "lng":-74.608154,
    "id":4,
	"direction": 1,
	"zoom": 8
  },
  {
    "title":"Philadelphia to Baltimore",
    "text":"<p>Woof. Delaware is a poor state for Amtrak’s Wi-Fi. (Joe Biden must not use it much there.) Once across the border in <a href=\"http://blogs.weta.org/boundarystones/2013/02/14/elkton-maryland-quickie-wedding-capital-east-coast\">Elkton, Maryland</a>, it picked up a bit to a roaring boil of, well, not much.</p>",
    "lat":39.590543,
    "lng":-75.869548,
    "id":5,
	"direction": 1,
	"zoom": 8
  },
  {
    "title":"Baltimore to Washington",
    "text":"<p>In the 8 p.m. hour on a Friday night, who’s doing a lot of work anyway, really? Not many people, it seemed, yet the Internet was slow.</p><p>Bottom line: Yes, Amtrak knows the Wi-Fi needs work and is on the case.</p><p>&ldquo;Amtrak's free Wi-Fi service is extremely popular, with the demand often consuming available bandwidth, particularly on busy trains,&rdquo; an Amtrak spokesperson emailed. &ldquo;In addition, current coverage from cellular towers and signal strength does not provide consistent coverage along each route.</p><p>&ldquo;Consequently, we are testing the technical and financial feasibility of constructing our own trackside high-speed broadband network on the Northeast Corridor. Should initial testing this spring prove promising, Amtrak would then build a test segment along a nine-mile stretch south of Wilmington, Delaware, later this year. After that section is built and tested, Amtrak will consider deploying along additional sections of the NEC.&rdquo;</p>",
    "lat":39.102024,
    "lng":-76.819153,
    "id":6,
	"direction": 1,
	"zoom": 9
  }
]